app/Models/Category.php

    public function getItemParents()
    {
        return $this->where('parent_id', 0)->where('is_deleted', NO_DELETED)->get();
---
select * from `categories` where `parent_id` = 0 and `is_deleted` = 0