app/Http/Controllers/Admin/AdminController.php

    public function index()
    {
        $user = User::all();
        $sale = Product::where('promotion_price','<>','0')->get();
        $order = Bill::all();
        $total = BillDetail::all();
---
select * from `users`
select * from `products` where `promotion_price` <> '0'
select * from `bills`
select * from `bill_detail`